lyzh-liyao/Cube_Project/STM32_Liyao_Frame/Frame/ComBuff.c
#if UART1_DMA_SENDER	|| UART2_DMA_SENDER || UART3_DMA_SENDER || UART4_DMA_SENDER || UART5_DMA_SENDER
/****************************************************
        函数名: HAL_UART_TxCpltCallback
        功能:   DMA发送完成中断 回调
        作者:   liyao 2016年9月14日10:55:11
****************************************************/
void HAL_UART_TxCpltCallback(UART_HandleTypeDef *huart){
  #ifdef UART1_DMA_SENDER
    if(huart == Uart1_DMA_Sender.Uart){
        Uart1_DMA_Sender.OverFlag = 0;
        FREE(Uart1_DMA_Sender.Data);
    }
  #endif
  #ifdef UART2_DMA_SENDER
    if(huart == Uart2_DMA_Sender.Uart){
        Uart2_DMA_Sender.OverFlag = 0;
        FREE(Uart2_DMA_Sender.Data);
    }
  #endif
  #ifdef UART3_DMA_SENDER
    if(huart == Uart3_DMA_Sender.Uart){
        Uart3_DMA_Sender.OverFlag = 0;
        FREE(Uart3_DMA_Sender.Data);
    }
  #endif
  #ifdef UART4_DMA_SENDER
    if(huart == Uart4_DMA_Sender.Uart){
        Uart4_DMA_Sender.OverFlag = 0;
        FREE(Uart4_DMA_Sender.Data);
    }
  #endif 
  #ifdef UART5_DMA_SENDER
    if(huart == Uart5_DMA_Sender.Uart){
        Uart5_DMA_Sender.OverFlag = 0;
        FREE(Uart5_DMA_Sender.Data);
    }
  #endif    
} 
#endif

/****************************************************
        函数名: HAL_UART_RxCpltCallback
        功能:   DMA接收完成中断 回调
        作者:   liyao 2016年9月14日10:55:11
****************************************************/ 
#if  UART1_DMA_RECEIVER || UART2_DMA_RECEIVER || UART3_DMA_RECEIVER || UART4_DMA_RECEIVER || UART5_DMA_RECEIVER
void HAL_UART_RxCpltCallback(UART_HandleTypeDef *huart){
  #ifdef UART1_DMA_RECEIVER
    if(huart == Uart1_DMA_Receiver.Uart){
      if(++Uart1_DMA_Receiver.Reversal == 2){
        Log.error("USART1_DMA_接收数据被覆盖\r\n");
				Uart1_DMA_Receiver.Reversal = 0;
			}
      HAL_UART_Receive_DMA(huart, Uart1_DMA_Receiver.Data, Uart1_DMA_Receiver.DMA_BuffSize); 
    } 
  #endif 
  #ifdef UART2_DMA_RECEIVER
    if(huart == Uart2_DMA_Receiver.Uart){
      if(++Uart2_DMA_Receiver.Reversal == 2){
        Log.error("USART2_DMA_接收数据被覆盖\r\n");
				Uart2_DMA_Receiver.Reversal = 0;
			}
      HAL_UART_Receive_DMA(huart, Uart2_DMA_Receiver.Data, Uart2_DMA_Receiver.DMA_BuffSize); 
    } 
  #endif 
  #ifdef UART3_DMA_RECEIVER
    if(huart == Uart3_DMA_Receiver.Uart){
      if(++Uart3_DMA_Receiver.Reversal == 2){
        Log.error("USART3_DMA_接收数据被覆盖\r\n");
				Uart3_DMA_Receiver.Reversal = 0;
			}
      HAL_UART_Receive_DMA(huart, Uart3_DMA_Receiver.Data, Uart3_DMA_Receiver.DMA_BuffSize); 
    } 
  #endif  
  #ifdef UART4_DMA_RECEIVER
    if(huart == Uart4_DMA_Receiver.Uart){
      if(++Uart4_DMA_Receiver.Reversal == 2){
        Log.error("USART4_DMA_接收数据被覆盖\r\n");
				Uart4_DMA_Receiver.Reversal = 0;
			}
      HAL_UART_Receive_DMA(huart, Uart4_DMA_Receiver.Data, Uart4_DMA_Receiver.DMA_BuffSize); 
    } 
  #endif   
  #ifdef UART5_DMA_RECEIVER
    if(huart == Uart5_DMA_Receiver.Uart){
      if(++Uart5_DMA_Receiver.Reversal == 2){
        Log.error("USART4_DMA_接收数据被覆盖\r\n");
				Uart5_DMA_Receiver.Reversal = 0;
			}
      HAL_UART_Receive_DMA(huart, Uart5_DMA_Receiver.Data, Uart5_DMA_Receiver.DMA_BuffSize); 
    } 
  #endif      
}
#endif
 
#if  UART1_DMA_RECEIVER || UART2_DMA_RECEIVER || UART3_DMA_RECEIVER || UART4_DMA_RECEIVER || UART5_DMA_RECEIVER ||\
		 UART1_DMA_SENDER	  || UART2_DMA_SENDER   || UART3_DMA_SENDER   || UART4_DMA_SENDER   || UART5_DMA_SENDER
void HAL_UART_ErrorCallback(UART_HandleTypeDef *huart){
	#ifdef UART1_DMA_SENDER
	if(huart == Uart1_DMA_Sender.Uart){
	  HAL_UART_Transmit_DMA(Uart1_DMA_Sender.Uart, Uart1_DMA_Sender.Data, Uart1_DMA_Sender.Len); 
		Log.error("huart1 TX DMA error:0x%X\r\n", huart->ErrorCode);
	}
	#endif
	#ifdef UART2_DMA_SENDER
	if(huart == Uart2_DMA_Sender.Uart){
	  HAL_UART_Transmit_DMA(Uart2_DMA_Sender.Uart, Uart2_DMA_Sender.Data, Uart2_DMA_Sender.Len); 
		Log.error("huart2 TX DMA error:0x%X\r\n", huart->ErrorCode);
	}
	#endif
	#ifdef UART3_DMA_SENDER
	if(huart == Uart3_DMA_Sender.Uart){
	  HAL_UART_Transmit_DMA(Uart3_DMA_Sender.Uart, Uart3_DMA_Sender.Data, Uart3_DMA_Sender.Len); 
		Log.error("huart3 TX DMA error:0x%X\r\n", huart->ErrorCode);
	}
	#endif
	#ifdef UART4_DMA_SENDER
	if(huart == Uart4_DMA_Sender.Uart){
	  HAL_UART_Transmit_DMA(Uart4_DMA_Sender.Uart, Uart4_DMA_Sender.Data, Uart4_DMA_Sender.Len); 
		Log.error("huart4 TX DMA error:0x%X\r\n", huart->ErrorCode);
	}
	#endif
	#ifdef UART5_DMA_SENDER
	if(huart == Uart5_DMA_Sender.Uart){
	  HAL_UART_Transmit_DMA(Uart5_DMA_Sender.Uart, Uart5_DMA_Sender.Data, Uart5_DMA_Sender.Len); 
		Log.error("huart5 TX DMA error:0x%X\r\n", huart->ErrorCode);
	}
	#endif
	
	#ifdef UART1_DMA_RECEIVER
	if(huart == Uart1_DMA_Receiver.Uart){
		HAL_UART_Receive_DMA(huart, Uart1_DMA_Receiver.Data, UART1_DMA_RECV_SIZE); 
		Log.error("huart1 RX DMA error:0x%X\r\n", huart->ErrorCode);
	}
	#endif
	#ifdef UART2_DMA_RECEIVER
	if(huart == Uart2_DMA_Receiver.Uart){
		HAL_UART_Receive_DMA(huart, Uart2_DMA_Receiver.Data, UART2_DMA_RECV_SIZE);
		Log.error("huart2 RX DMA error:0x%X\r\n", huart->ErrorCode); 
	}
	#endif
	#ifdef UART3_DMA_RECEIVER
	if(huart == Uart3_DMA_Receiver.Uart){
		HAL_UART_Receive_DMA(huart, Uart3_DMA_Receiver.Data, UART3_DMA_RECV_SIZE);
		Log.error("huart3 RX DMA error:0x%X\r\n", huart->ErrorCode); 
	}
	#endif
	#ifdef UART4_DMA_RECEIVER
	if(huart == Uart4_DMA_Receiver.Uart){
		HAL_UART_Receive_DMA(huart, Uart4_DMA_Receiver.Data, UART4_DMA_RECV_SIZE); 
		Log.error("huart4 RX DMA error:0x%X\r\n", huart->ErrorCode);
	}
	#endif
	#ifdef UART5_DMA_RECEIVER
	if(huart == Uart5_DMA_Receiver.Uart){
		HAL_UART_Receive_DMA(huart, Uart5_DMA_Receiver.Data, UART5_DMA_RECV_SIZE); 
		Log.error("huart5 RX DMA error:0x%X\r\n", huart->ErrorCode);
	}
	#endif
//	while(1);
}
#endif
//--------------------------------快捷调用-------------------------------------
#if UART1_DMA_SENDER	|| UART2_DMA_SENDER || UART3_DMA_SENDER || UART4_DMA_SENDER || UART5_DMA_SENDER
/****************************************************
        函数名: SenderKeepTransmit
        功能:   持续传输发送者缓冲区中的缓冲数据
        作者:   liyao 2016年9月14日10:55:11
****************************************************/   
__weak void SenderKeepTransmit(void){
#if UART1_DMA_SENDER == 1
  Uart1_DMA_Sender.KeepTransmit(&Uart1_DMA_Sender);
#endif
#if UART2_DMA_SENDER == 1
  Uart2_DMA_Sender.KeepTransmit(&Uart2_DMA_Sender);
#endif
#if UART3_DMA_SENDER == 1
  Uart3_DMA_Sender.KeepTransmit(&Uart3_DMA_Sender);
#endif
#if UART4_DMA_SENDER == 1
  Uart4_DMA_Sender.KeepTransmit(&Uart4_DMA_Sender);
#endif
#if UART5_DMA_SENDER == 1
  Uart5_DMA_Sender.KeepTransmit(&Uart5_DMA_Sender);
#endif
}
#else
__weak void SenderKeepTransmit(void){;}
#endif

#if  (PROTOCOL_RESOLVER_1 && UART1_DMA_RECEIVER) || (PROTOCOL_RESOLVER_2 && UART2_DMA_RECEIVER)|| (PROTOCOL_RESOLVER_3 && UART3_DMA_RECEIVER) || (PROTOCOL_RESOLVER_4 && UART4_DMA_RECEIVER) || (PROTOCOL_RESOLVER_5 && UART5_DMA_RECEIVER)
/****************************************************
        函数名: PaddingProtocol
        功能:   从串口缓冲区中读取数据到协议解析器
        作者:   liyao 2016年9月14日10:55:11
****************************************************/ 
__weak void PaddingProtocol(void){
	#define BUFFSIZE 100
	int8_t cnt = 0;
	uint8_t data[BUFFSIZE] = {0};  
	#if PROTOCOL_RESOLVER_1 && UART1_DMA_RECEIVER
    while((cnt = Uart1_DMA_Receiver.ReadTo(&Uart1_DMA_Receiver,0xf8,data,BUFFSIZE))>0)
			ProtocolResolver_1->Protocol_Put(ProtocolResolver_1,data,cnt);
  #endif
	#if PROTOCOL_RESOLVER_2 && UART2_DMA_RECEIVER
		while((cnt = Uart2_DMA_Receiver.ReadTo(&Uart2_DMA_Receiver,0xf8,data,BUFFSIZE))>0)
			ProtocolResolver_2->Protocol_Put(ProtocolResolver_2,data,cnt);  
	#endif
	#if PROTOCOL_RESOLVER_3 && UART3_DMA_RECEIVER
		while((cnt = Uart3_DMA_Receiver.ReadTo(&Uart3_DMA_Receiver,0xf8,data,BUFFSIZE))>0)
			ProtocolResolver_3->Protocol_Put(ProtocolResolver_3,data,cnt);  
	#endif
	#if PROTOCOL_RESOLVER_4 && UART4_DMA_RECEIVER
		while((cnt = Uart4_DMA_Receiver.ReadTo(&Uart4_DMA_Receiver,0xf8,data,BUFFSIZE))>0)
			ProtocolResolver_4->Protocol_Put(ProtocolResolver_4,data,cnt);  
	#endif
	#if PROTOCOL_RESOLVER_5 && UART5_DMA_RECEIVER
		while((cnt = Uart5_DMA_Receiver.ReadTo(&Uart5_DMA_Receiver,0xf8,data,BUFFSIZE))>0)
			ProtocolResolver_5->Protocol_Put(ProtocolResolver_5,data,cnt);  
	#endif
}
#else
__weak void PaddingProtocol(void){;}
#endif

#if PROTOCOL_RESOLVER_IT_1 || PROTOCOL_RESOLVER_IT_2 || PROTOCOL_RESOLVER_IT_3 || PROTOCOL_RESOLVER_IT_4 || PROTOCOL_RESOLVER_IT_5
__weak uint8_t  PaddingProtocol_IT(void){
#if PROTOCOL_RESOLVER_IT_1
	#if MCU_TYPE == 030
	if(((READ_REG(USART1->ISR) & USART_ISR_RXNE) != RESET) && ((READ_REG(USART1->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART1->RDR);
	#elif MCU_TYPE == 103
	if(((READ_REG(USART1->SR) & USART_SR_RXNE) != RESET) && ((READ_REG(USART1->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART1->DR);	
	#endif
//		USART1->DR = UartData;
		ProtocolResolver_1->Protocol_Put(ProtocolResolver_1,&UartData,1);
		return 1;
	}
#endif
#if PROTOCOL_RESOLVER_IT_2
	#if MCU_TYPE == 030
	if(((READ_REG(USART2->ISR) & USART_ISR_RXNE) != RESET) && ((READ_REG(USART2->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART2->RDR);
	#elif MCU_TYPE == 103
	if(((READ_REG(USART2->SR) & USART_SR_RXNE) != RESET) && ((READ_REG(USART2->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART2->DR);
	#endif
		ProtocolResolver_2->Protocol_Put(ProtocolResolver_2,&UartData,1);
		return 1;
	}
#endif
#if PROTOCOL_RESOLVER_IT_3
	#if MCU_TYPE == 030
	if(((READ_REG(USART3->ISR) & USART_ISR_RXNE) != RESET) && ((READ_REG(USART3->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART3->RDR);
	#elif MCU_TYPE == 103
	if(((READ_REG(USART3->SR) & USART_SR_RXNE) != RESET) && ((READ_REG(USART3->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART3->DR);
	#endif
//		USART1->DR = UartData;
		ProtocolResolver_3->Protocol_Put(ProtocolResolver_3,&UartData,1);
		return 1;
	}
#endif
#if PROTOCOL_RESOLVER_IT_4
	#if MCU_TYPE == 030
	if(((READ_REG(USART4->ISR) & USART_ISR_RXNE) != RESET) && ((READ_REG(USART4->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART4->RDR);
	#elif MCU_TYPE == 103
	if(((READ_REG(USART4->SR) & USART_SR_RXNE) != RESET) && ((READ_REG(USART4->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART4->DR);
	#endif
		ProtocolResolver_4->Protocol_Put(ProtocolResolver_4,&UartData,1);
		return 1;
	}
#endif
#if PROTOCOL_RESOLVER_IT_5
	#if MCU_TYPE == 030
	if(((READ_REG(USART5->ISR) & USART_ISR_RXNE) != RESET) && ((READ_REG(USART5->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART5->RDR);
	#elif MCU_TYPE == 103
	if(((READ_REG(USART5->SR) & USART_SR_RXNE) != RESET) && ((READ_REG(USART5->CR1) & USART_CR1_RXNEIE) != RESET)){
		uint8_t UartData =  READ_REG(USART5->DR);
	#endif
		ProtocolResolver_5->Protocol_Put(ProtocolResolver_5,&UartData,1);
		return 1;
	}
#endif
	return 0;
}
#endif


/****************************************************
	函数名:	ComBuff_Init
	功能:		初始化全部通信缓冲区
	作者:		liyao 2016年4月4日22:02:12 
****************************************************/
void ComBuff_Init(void){
//UART1 初始化
#ifdef UART1_DMA_SENDER
  DMA_Sender_Init(&Uart1_DMA_Sender, &huart1);
#endif  
#ifdef UART1_DMA_RECEIVER
  DMA_Receiver_Init(&Uart1_DMA_Receiver, &huart1, UART1_DMA_RECV_SIZE); 
#endif  
#ifdef UART2_DMA_SENDER
  DMA_Sender_Init(&Uart2_DMA_Sender, &huart2);
#endif  
#ifdef UART2_DMA_RECEIVER
  DMA_Receiver_Init(&Uart2_DMA_Receiver, &huart2, UART2_DMA_RECV_SIZE); 
#endif 
#ifdef UART3_DMA_SENDER
  DMA_Sender_Init(&Uart3_DMA_Sender, &huart3);
#endif  
#ifdef UART3_DMA_RECEIVER
  DMA_Receiver_Init(&Uart3_DMA_Receiver, &huart3, UART3_DMA_RECV_SIZE); 
#endif
#ifdef UART4_DMA_SENDER
  DMA_Sender_Init(&Uart4_DMA_Sender, &huart4);
#endif  
#ifdef UART4_DMA_RECEIVER
  DMA_Receiver_Init(&Uart4_DMA_Receiver, &huart4, UART4_DMA_RECV_SIZE); 
#endif 
#ifdef UART5_DMA_SENDER
  DMA_Sender_Init(&Uart5_DMA_Sender, &huart5);
#endif  
#ifdef UART5_DMA_RECEIVER
  DMA_Receiver_Init(&Uart5_DMA_Receiver, &huart5, UART5_DMA_RECV_SIZE); 
#endif 
#ifdef __TASKTIMEMANAGER_H__
	/*-----------持续传输任务-----------------*/
  TaskTime_Add(TaskID++, TimeCycle(0,10), SenderKeepTransmit, Real_Mode);
	/*-----------协议解析任务-----------------*/
  TaskTime_Add(TaskID++, TimeCycle(0,10), PaddingProtocol, Real_Mode);
#endif
}
//--------------------------------printf实现-------------------------------------
/*
void printch(char ch);
void printdec(int dec);
void printflt(double flt);
void printstr(char* str);
void printbin(int bin);
void printhex(int hex);
void StringFormat(char* target, uint8_t type,const char* fmt,va_list vp);

void printch(char ch)
{
#ifdef LL_LIB
		LL_USART_TransmitData8(DEBUG_USART,ch);
#else
	while(HAL_UART_Transmit(&DEBUG_USART, (uint8_t*)&ch, 1, 100) == HAL_BUSY);
#endif
}

