lyzh-liyao/Cube_Project/STM32_Liyao_Frame/Frame/ComBuff.c
void mvprintf(const char* fmt,va_list vp){
	StringFormat(NULL, 0, fmt, vp);
}

void msprintf(char* target,const char* fmt,va_list vp){
	StringFormat(target, 1, fmt, vp);
}

void mprintf(const char* fmt, ...)
{
    va_list vp;
    va_start(vp, fmt);
		mvprintf(fmt, vp);
    va_end(vp);
}

void StringFormat(char* target,uint8_t type,const char* fmt,va_list vp){
	double vargflt = 0;
    int  vargint = 0;
    char* vargpch = NULL;
    char vargch = 0;
    const char* pfmt = NULL;
    pfmt = fmt;

    while(*pfmt)
    {
        if(*pfmt == '%')
        {
            switch(*(++pfmt))
            {
                
                case 'c':
                    printch(vargch);
                    break;
                case 'd':
                case 'i':
                    vargint = va_arg(vp, int);
                    printdec(vargint);
                    break;
                case 'f':
                    vargflt = va_arg(vp, double);
                    printflt(vargflt);
                    break;
                case 's':
                    vargpch = va_arg(vp, char*);
                    printstr(vargpch);
                    break;
                case 'b':
                case 'B':
                    vargint = va_arg(vp, int);
                    printbin(vargint);
                    break;
                case 'x':
                case 'X':
                    vargint = va_arg(vp, int);
                    printhex(vargint);
                    break;
                case '%':
                    printch('%');
                    break;
                default:
                    break;
            }
            pfmt++;
        }
        else
        {
						if(type == 0)
							printch(*pfmt++);
						else if(type == 1)
							*target++ = *pfmt++;
        }
    }
}


void printdec(int dec)
{
	char buff[20] = {0};
	int8_t i = 0;
	int num = dec;
	do{
		num /= 10;
		i++;
	}while(num != 0);
	
	if(dec < 0){
		buff[0] = '-';
		i++;
	}
	while(--i >= 0){
		buff[i] = dec%10 + '0';
		dec /= 10;
	}
	printstr(buff);
}

void printflt(double flt)
{
    int tmpint = 0;
    tmpint = (int)flt;
    printdec(tmpint);
    printch('.');
    flt = flt - tmpint;
    tmpint = (int)(flt * 1000000);
    printdec(tmpint);
}

void printstr(char* str)
{
    while(*str)
    {
        printch(*str++);
    }
}

void printbin(int bin)
{
    if(bin == 0)
    {
        printstr("0b");
        return;
    }
    printbin(bin/2);
    printch( (char)(bin%2 + '0'));
}

void printhex(int hex)
{
    if(hex==0)
    {
        printstr("0x");
        return;
    }
    printhex(hex/16);
    if(hex < 10)
    {
        printch((char)(hex%16 + '0'));
    }
    else
    {
        printch((char)(hex%16 - 10 + 'a' ));
    }
}
*/

